Revit 2027 API
FilteredElementIterator.GetCurrent Method
 The current element found by the iterator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Element GetCurrent()
Public Function GetCurrent As Element
public:
Element^ GetCurrent()
member GetCurrent : unit -> Element
Return Value
Element
 The element.
Exceptions
Exception | Condition
InvalidOperationException |  There are no more element ids in the iterator. -or- The FilteredElementCollector that yielded this iterator has been reset by another operation. No further iteration is permitted with this iterator. -or- The iterator cannot proceed due to changes made to the Element table in Revit's database (typically, This can be the result of an Element deletion).
See Also
Reference
FilteredElementIterator Class
Autodesk.Revit.DB Namespace